{"url": "www.health.com/health/gallery/0,,20466776,00.html", "text": "Healthy or not, here's a look at some of the most dramatic transformations.\n\nFast weight gain can be bad news too, particularly for the heart and joints.\n\nCrash diets can weaken your immune system, leaving you more vulnerable to getting sick and may even hurt your heart.\n\nThe problem? This type of dieting can be bad for your health.\n\nWhether they're slimming down to play a perfectionist ballerina or bulking up to a gladiator-esque stature, celebrities often need to change their shape drastically —and on short notice—to ace roles (or meet the expectations of a critical public).\n\n01 of 25 Jennifer Hudson Sipa The Grammy and Oscar winner's dramatic weight loss was the makeover on everyone's lips in 2010. In August 2009, Hudson had to lose her baby weight before shooting her next movie, Winnie, in which she plays Nelson Mandela's wife (due out this year). She worked out regularly with celeb trainer Harley Pasternak and cut back on calories with help from the Weight Watchers program. In April 2010, Hudson, 32, became the face of Weight Watchers. She had slimmed down from a size 16 to a slender size 6.\n\n02 of 25 Christian Bale Picture Desk/Getty Images This Batman famously lost a startling 63 pounds to play a chronic insomniac in the film The Machinist. Bale, now 39, reportedly took supplements to make sure he still got his vitamins but hardly ate and over exercised to trim himself to only 122 pounds (he's 6 feet tall!). He slimmed down again more recently from his normal 185 pounds to play a former professional boxer in The Fighter.\n\n03 of 25 Oprah Winfrey Corbis When it comes to weight-loss tabloid fodder, Oprah, 59, reigns supreme. Her weight has fluctuated often and drastically, and it's always been \"breaking news.\" The yo-yoing is partly due to a thyroid condition, which she said she had leaned on as an excuse to eat whatever she wanted in the past. In the early 2000s, she trimmed down to a fit 160 and thought she had finally conquered her weight issues. But in 2008, she opened up that she had hit 200 pounds—again. In 2010, she announced on her show that she would never diet again.\n\n04 of 25 Drew Carey Sipa For funny guy Drew Carey, 55, the extra pounds were becoming a serious health issue. After losing 80 since January 2010, Carey told People magazine he no longer needs medication for his type 2 diabetes. To slim down, he stuck to a diet high in protein, fruits, and veggies, and a tough regimen of 45 minutes of cardio six times a week.\n\n05 of 25 John Goodman Getty Images/Sipa The actor, perhaps best known for his beefy Dan Conner on Roseanne, tipped the scales at 368 pounds in 2007. Since then, Goodman, 61, has quit drinking, cut sugar out of his diet—and gotten off the couch. Now he works out six days a week and is down more than 100 pounds!\n\n06 of 25 50 Cent Twitter 50Cent/Sipa The rapper's shocking weight loss wasn't because of any health concerns; it was because of his role as a cancer patient in the upcoming film Things Fall Apart. In May 2010, 50 Cent, 38, revealed emaciated-looking photos of himself. He had dropped from 214 pounds to a slight 160 in just nine weeks. With shooting wrapped, he was back to looking like himself by September 2010.\n\n07 of 25 Kevin Federline Getty Images Once a toned dancer, the former Mr. Britney Spears ballooned to 240 pounds around the time of his 30th birthday. Never one to pass up a chance in the spotlight, K-Fed, 35, appeared on VH1's reality show Celebrity Fit Club in 2010 to try to slim down, but he has continued to struggle with his weight.\n\n08 of 25 Kelly Osbourne Getty Images/Sipa After a stint on Dancing with the Stars, Ozzy's daughter quit her emotional eating and dropped 50 pounds. All the dance workouts and weight training paid off for the 29-year-old; she bared her new size 2 body on the December 2010 cover of Shape magazine.\n\n09 of 25 Jared Leto Sipa The actor gained 60 pounds to play the role of John Lennon's killer in the film Chapter 27. The sudden and dramatic gain left him with severe gout-like foot pain. Leto, 41, told the New York Daily News that he \"gorged and force-fed\" himself to put on the pounds. He said it took over a year to feel like he was back to normal and won't be gaining weight for a role again.\n\n10 of 25 Charlize Theron Picture Desk/Getty Images The actress gained 30 pounds eating doughnuts, and was almost unrecognizable as a prostitute and serial killer in 2003's Monster. She returned to her normal weight even before the film's premiere. Theron, 38, who has said she is usually around a size 8 and likes her curves, went on to win the Golden Globe for Best Actress for the role.\n\n11 of 25 Star Jones Reynolds Getty Images The former co-host of The View at first wouldn't fess up to having gastric bypass surgery. But having dropped around 160 pounds in just three years, Reynolds, 51, came clean in 2007 that she had done something drastic to lose the weight. Bariatric surgery isn't a quick fix, though. Continuing to eat an unhealthy diet after the procedure can cause patients to gain weight right back. However, surgery can be a viable option for the extremely obese.\n\n12 of 25 Michael Moore Getty Images The opinionated filmmaker dropped a dramatic 70 pounds by eliminating salt, sugar, and white flour from his diet, and upping his exercise regimen to walking 30 to 40 minutes every day. Moore, 59, allegedly checked into a Florida weight-loss spa in 2007 and again in December 2010.\n\n13 of 25 Janet Jackson Getty Images A notorious yo-yo dieter, Janet Jackson and her weight have been a near constant topic in the media. She showed off her incredible body in our December 2010 issue and admitted eating only an apple and a small bag of tortilla chips a day while preparing for her Love Will Never Do music video shoot. Today, Jackson, 47, sticks to a much healthier pescatarian diet and works out regularly with a trainer.\n\n14 of 25 Perez Hilton Getty Images The self-proclaimed \"Queen of All Media\" celebrity blogger slimmed down by eating healthier and gradually adding gym workouts, dropping over 60 pounds in three years. What started as simple 30-minute daily walks became 7-days-a-week training sessions, and, eventually, Hilton, 35, whose real name is Mario Lavandeira Jr., opted for delivery meals. In October 2010, he even launched a new site, called FitPerez.com, focused on fitness and the healthy habits of his favorite A-listers.\n\n15 of 25 Nicole Richie Getty Images/Sipa In 2006, the 5'2\" socialite weighed only about 90 pounds—dangerously thin even by Hollywood standards—and sought treatment for her weight issues. Many speculated she was suffering from an eating disorder, although she never spoke openly about it. Richie, 32, who has two children and was recently married, has remained slim, but appears to be at a healthier weight than at her thinnest.\n\n16 of 25 Seth Rogen Getty Images/Sipa Since first gracing the silver screen, funny guy Seth Rogen has slimmed down significantly by working out with trainer to the stars Harley Pasternak. The 31-year-old ditched around 30 pounds in nine months.\n\n17 of 25 Renee Zellweger Getty Images To play the classic, awkward thirtysomething role of Bridget Jones, actress Renee Zellweger, now 44, gained 20 pounds and went from a size 4 to a size 14. Perhaps more shocking was her post-Bridget Jones slim down. She dieted to lose the weight she had put on, and continued to lose even after returning to her healthy size 4. Constant weight fluctuations, like Zellweger's, can make it harder for dieters to lose pounds and keep them off in the long run.\n\n18 of 25 Valerie Bertinelli Getty Images In 2007, after reaching 172 pounds, the actress became a spokeswoman for Jenny Craig and lost 50 pounds. Our former cover girl, 53, now stays around 128 pounds by watching her portion sizes and getting active—she even ran the 2010 Boston Marathon!\n\n19 of 25 Mo'Nique Getty Images Although the comedian and actress was always vocal about loving her body the way it was, she made the decision to get healthy after being diagnosed with high blood pressure and topping out at 262 pounds. Mo'Nique, 45, lost around 45 pounds in 2009 by eating healthier. She nixed junk food, red meat, and fried foods, and went from a size 20 to a 14.\n\n20 of 25 Ron Lester Corbis/Getty Images Best known for playing Billy Bob in 1999's Varsity Blues, Lester, now 43, was over 500 pounds at his heaviest. By December of 2000 he had had enough of playing obese characters and not being able to move comfortably on the set. He turned to gastric bypass surgery (which was still experimental at the time) and needed 17 follow-up procedures to remove excess skin. He slimmed down to a healthy 193 pounds.\n\n21 of 25 Al Roker Getty Images The Today show's weather anchor also turned to surgery to get trim. Roker, 59, weighed over 340 pounds in 2002 and was wearing a size 60 suit. His weight had fluctuated throughout his life, but he had always gained the 30- or 40-pound losses back. In 2002, he underwent gastric bypass surgery at his wife's suggestion and dropped 140 pounds. He says that he has finally accepted that maintaining a healthy weight will be a lifelong battle even after surgery. Today, he watches his portion sizes and exercises regularly to stay around 200 pounds.\n\n22 of 25 Kirstie Alley Getty Images One of the most notorious yo-yo dieters, actress Kirstie Alley, 62, was once the face of Jenny Craig. She lost 75 pounds with the diet plan's help, but gained much of it back after her contract ended. She starred in her own show about her struggle with her weight in the mid-2000s, when her weight had ballooned to over 200. In 2008, she pledged to lose 80 pounds, and tweeted in September 2010 that she had just 30 more to go.\n\n23 of 25 Ricki Lake Getty Images Weight played a key role in the actress's big break in 1988's Hairspray, where she portrayed chubby Tracy Turnblad. But Lake, now 45, struggled throughout the next 20 years, losing an extreme 100 pounds in 1992 by \"starving\" herself, she said. However, after limiting calories more responsibly and joining a fresh-food delivery service, she shed 140 pounds and maintains a healthy size 6.\n\n24 of 25 Randy Jackson Getty Images In 2002, the American Idol judge weighed over 300 pounds. The music legend, 57, struggled to keep his diabetes under control and opted for gastric bypass surgery in 2003. He lost 100 pounds and has kept it off by eating fewer processed foods, cutting back on fat and sugar, and spending more time walking on his treadmill and playing tennis.", "images": ["https://www.health.com/thmb/dT3cPz2YPAbIY4OGlUREvP6B3Mk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/erica-stepteau-before-400x400-d97e4253d632478f83847d5a62393442.jpg", "https://www.health.com/thmb/f__pfc6MjqxFQcv6drS_IVXgU5A=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/kevin-federline-400x400-0ed185b658c74252817917c86faa91a1.jpg", "https://www.health.com/thmb/akt8OIPBRkFjXkWHMyWf0-hGAsE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/brandy-sanders-before-462x242-ab0e3d16d24d481587df2c3dde580d0f.jpg", "https://www.health.com/thmb/glrXhXOhmWjJ7nlqDaEqe08FLbM=/400x400/filters:fill(auto,1)/actors-weight-loss-gain-400x400-f8a5239a9b234b4f87b11f0bb5dbe9c0.jpg", "https://www.health.com/thmb/Tu_jtm3T6DVwujAihC2g5WkXeH0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/mind-over-matter-raw-705bcc41fd994cdaa99140ea3e2a9d1e.jpg", "https://www.health.com/thmb/kmJr7dZ_ljiDSJQSSii0fSv3mkM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/seth-rogan-400x400-476b4e4d5d754782ac3800fc32d23d17.jpg", "https://www.health.com/thmb/VpXWCkFfuHdwVr30cjBh9WrfN_4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/valerie-bertinelli-400x400-030a1d81bfed452db504ed027e2ae567.jpg", "https://www.health.com/thmb/9kHuirBVCWIEppdMVe5qeyFK4Uk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/sara-rue-400x400-9ddb66336bbd45aab36f32651cddabe4.jpg", "https://www.health.com/thmb/5gnMSPEF13j13sGbMmwjTMZ6m24=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/celebs-anxiety-2000-1ae9f6c347504c4a87b3187c1a222800.jpg", "https://www.health.com/thmb/lZhUoPLGfmpnPQeF-OWj6e15Ujw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/famous-people-ibs-400x400-1e2cc74365f24d8c9cf61afe17bbe0b4.jpg", "https://www.health.com/thmb/bZWjeLGPXOxiSHROjp4yQJQqnKY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-sb10067258bg-001-2000-62d7187dda2c43dda449ff9e54bebda2.jpg", "https://www.health.com/thmb/EIpvawZ8d4YaGmn2n4KqEvOahb8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/50-cent-400x400-744d6107daa547e2802f5e7686173a4c.jpg", "https://www.health.com/thmb/Jt9-k0XvN9FPhjWcKpt6xSUju2I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/heart-myths-facts-200x150-82a1ebfe56aa4986b85c44ef480c9c85.jpg", "https://www.health.com/thmb/fbuMzpd-lZAaP5m_ecVh9_Jxczk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/one-legged-plank-gettyimages-1095030360-2000-597674836d3f4a18a2a95e1ae786c582.jpg", "https://www.health.com/thmb/5eiHs7OTH9c_a5B-BNswq1YRRuU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/john-goodman-400x400-2618ad489ea4429fadbd5466f666b909.jpg", "https://www.health.com/thmb/8CYQXSe5Z49_VAXDutIGshnUeVs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/janet-jackson-400x400-601a8af697094e3384fa95287689e068.jpg", "https://www.health.com/thmb/Ecyd_NOAKbcqJeGl2NQ4VjGRjvQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/charlize-theron-400x400-1240bd29b79742389c9a8d950b7ed900.jpg", "https://www.health.com/thmb/UPcEVxxTDFjS3dsmexMLAlTLyeU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/ron-lester-400x400-3fc641129da14d7ab4bd56be8e502c22.jpg", "https://www.health.com/thmb/6UzvYaGdYyIOkDmbtBEQoDsGIUs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/al-roker-400x400-110a893f3da14c07b63db79faf278f3f.jpg", "https://www.health.com/thmb/ZrdnzYrtaQjxh_odF3xjTwMg094=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/eat-super-fruit-400x400-427b5546073144ffa941644b52ae6e32.jpeg", "https://www.health.com/thmb/I4DKqv6peVT0IKdYDrj_bP-01V0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/kelly-osbourne-400x400-8db5d6ffda32490d8e386c9640043efd.jpg", "https://www.health.com/thmb/hbDXNonDZr8wZoH_9a60XmWBaDg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/perez-hilton-weight-loss-400x400-fae0fc00361e47f0852445b726f6824b.jpg", "https://www.health.com/thmb/yro7dm1MHXt4QgBjziUTzcIn8JY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/drew-carey-400x400-0fe9cd9de1e44d50904246dfe6ca9241.jpg", "https://www.health.com/thmb/XVGO25GOLMMVJqJPXmke9pBv3SU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/randy-jackson-400x400-d39ea4234f494ce29495e89bae6375e6.jpg", "https://www.health.com/thmb/y7pdjSCK8fkZmQSpKVHnnMO6jzI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/michael-moore-400x400-1f4aebe395fe44049f0bb46f0b1b1db1.jpg", "https://www.health.com/thmb/Yaihk2n-PgQB4IfqUh0rCzE2idk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/renee-zellweger-400x400-62f6fbc3e61a4f9fb8e431f17cbed5f2.jpg", "https://www.health.com/thmb/Ru4R6Kp9Bzkp469zMbJdxtgLJeg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/christian-bale-400x400-7890c881b09f4cbcbac18fa13ed14d15.jpg", "https://www.health.com/thmb/vsCqVS5yLSxEO2qXeCQhWJS393Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Elizabeth-OConnor-8c44b7be2fa14e0b8b156cca681e8c1c.jpg", "https://www.health.com/thmb/PqTVLWCWFULObfT0Hn61hCQxdjY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/julia-weight-loss-sugery-2000-a951b27dfca04c5f81c4079122f04165.jpg", "https://www.health.com/thmb/xSyFt7WpsTVx36w4By4eqMgKiVM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/oprah-winfrey-400x400-a92b8ce0a3544512986e7eefeea45507.jpg", "https://www.health.com/thmb/rb8Jp3kqNEPfV_-SGEugYO0jNgI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/nicole-richie-400x400-54f523db33194b7b8bba0008471267fa.jpg", "https://www.health.com/thmb/4DJQprrhQ8ngd_7GmzZCY2FhWHQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/jennifer-hudson-400x400-ee763628c5d74ebcb0207904604db961.jpg", "https://www.health.com/thmb/jVoNNVMwpYv0LcmsmomqnNP22eI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/celebrities-with-diabetes-400x400-ed281d06abb841c99f647f214703f3c7.jpg", "https://www.health.com/thmb/TWfZ0W00G0Gwn-WwdU_bzQY77ck=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/keto-celebs-tout-2000-5e4fa7da4b404aeab8b8137dd20804bd.png", "https://www.health.com/thmb/vQd_PDL8rW8-l-O6FZkLEZOPif4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/shapa-numberless-scale-black_copy_copy-2000-fea58becb6324edfbc8e38a68f483b2e.jpg", "https://www.health.com/thmb/jHU3YRauSiARpIe57EkmVh8qCRs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/jared-leto-before-400x400-2022a756336c4f92b3a1365f105163cc.jpg", "https://www.health.com/thmb/Dr85Zv-Ain_fi0lR3dSlYpajCpk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/celebrities-with-depression-400x400-a699f30b1a904ade8e9e1aa399254505.jpg", "https://www.health.com/thmb/mgpniFKAQ_2lwr81aWFsXw_ZOuo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/monique-400x400-70a85991791d41698e4a2a07cfc4aa02.jpg", "https://www.health.com/thmb/MZGXZ7w_-AquSQ4jZOXvap9hKMU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/gettyimages-807078414-2000-a4f8d8fa57ee41d7af19fc0eee3a6409.jpg", "https://www.health.com/thmb/MHwxVYyjI6eD5P_-dZrlaUbKy3c=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/ricki-lake-weight-loss-400x400-e27b63e8e49b444da050f4eb0964c05f.jpg", "https://www.health.com/thmb/XKgGqkNpG5B6uxtVdHIQ5KqGnzE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/star-jones-400x400-210e674ada9146f7860334000f446f78.jpg", "https://www.health.com/thmb/l6mhswDjhyiOcOP_m-jaymJj430=/650x0/filters:no_upscale():max_bytes(150000):strip_icc()/kristen-alley-400x400-2323b2b7fd49456e8cf89bb4e0d13fcc.jpg"], "top_img": "https://www.health.com/thmb/glrXhXOhmWjJ7nlqDaEqe08FLbM=/400x400/filters:fill(auto,1)/actors-weight-loss-gain-400x400-f8a5239a9b234b4f87b11f0bb5dbe9c0.jpg", "keywords": [], "authors": ["Sarah Klein", "Sarah Klein Is A Health Writer", "Editor", "Certified Personal Trainer With Over A Decade Of Experience In Media. She Has Held Editorial Positions At Livestrong.Com", "Health", "Prevention", "The Huffington Post.", "Health'S Editorial Guidelines"], "canonical_link": "https://www.health.com/weight-loss/25-shocking-celebrity-weight-changes", "title": "25 Shocking Celebrity Weight Changes", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Check out these shocking celebrity weight changes. Some gained weight while others lost weight for acting roles as well as to live a better lifestyle.", "emailcontenttype": "LISTSC", "emailvertical": "HEALTH", "sailthru.author": "Sarah Klein", "article": {"section": "Health", "opinion": "false", "author": "https://www.facebook.com/Health/"}, "fb": {"app_id": 979081782488298, "pages": 14482400667}, "og": {"type": "article", "site_name": "Health", "url": "https://www.health.com/weight-loss/25-shocking-celebrity-weight-changes", "title": "25 Shocking Celebrity Weight Changes", "description": "Check out these shocking celebrity weight changes. Some gained weight while others lost weight for acting roles as well as to live a better lifestyle.", "image": "https://www.health.com/thmb/glrXhXOhmWjJ7nlqDaEqe08FLbM=/400x400/filters:fill(auto,1)/actors-weight-loss-gain-400x400-f8a5239a9b234b4f87b11f0bb5dbe9c0.jpg"}, "twitter": {"card": "summary_large_image", "site": "@health_com_", "title": "25 Shocking Celebrity Weight Changes", "description": "Check out these shocking celebrity weight changes. Some gained weight while others lost weight for acting roles as well as to live a better lifestyle.", "image": "https://www.health.com/thmb/glrXhXOhmWjJ7nlqDaEqe08FLbM=/400x400/filters:fill(auto,1)/actors-weight-loss-gain-400x400-f8a5239a9b234b4f87b11f0bb5dbe9c0.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.35.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.35.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.35.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.35.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.35.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "http://www.health.com", "summary": ""}