{"url": "http://www.nfib-sbet.org/", "text": "SMALL BUSINESS ECONOMIC TRENDS\n\nThe NFIB Small Business Optimism Index dropped 3.6 points in June to 89.5, marking the sixth consecutive month below the 48-year average of 98. Small business owners expecting better business conditions over the next six months decreased seven points to a net negative 61%, the lowest level recorded in the 48-year survey. Expectations for better conditions have worsened every month this year.\n\nInflation continues to be a top problem for small businesses with 34% of owners reporting it was their single most important problem in operating their business, an increase of six points from May and the highest level since quarter four in 1980.\n\n“As inflation continues to dominate business decisions, small business owners’ expectations for better business conditions have reached a new low,” said NFIB Chief Economist Bill Dunkelberg. “On top of the immediate challenges facing small business owners including inflation and worker shortages, the outlook for economic policy is not encouraging either as policy talks have shifted to tax increases and more regulations.”\n\nKey findings include:\n\n– The net percent of owners who expect real sales to be higher decreased 13 points from May to a net negative 28%, a severe decline.\n\n– Fifty percent of owners reported job openings that could not be filled, down one point from May, but historically very high.\n\n– The net percent of owners raising average selling prices decreased three points to a net 69% seasonally adjusted, following May’s record high reading.\n\nAs reported in NFIB’s monthly jobs report, owners’ plans to fill open positions remain elevated, with a seasonally adjusted net 19% planning to create new jobs in the next three months, but down seven points from May. Ninety-four percent of those hiring or trying to hire reported few or no qualified applicants for the positions they were trying to fill.\n\nFifty-one percent of owners reported capital outlays in the last six months, down two points from May. Of those making expenditures, 37% reported spending on new equipment, 23% acquired vehicles, and 14% improved or expanded facilities. Five percent acquired new buildings or land for expansion and 13% spent money for new fixtures and furniture. Twenty-three percent of owners plan capital outlays in the next few months, down two points from May.\n\nA net negative 2% of all owners (seasonally adjusted) reported higher nominal sales in the past three months, down three points from May. The net percent of owners expecting real sales volumes decreased 13 points to a net negative 28%.\n\nThe net percent of owners reporting inventory increases fell three points to a net negative 4%. Thirty-nine percent reported that supply chain disruptions have had a significant impact on their business. Another 30% report a moderate impact and 23% report a mild impact. Only 6% report no impact from recent supply chain disruptions.\n\nA net 5% of owners viewed current inventory stocks as “too low” in June, down three points from May and still surprisingly high. By industry, shortages are reported most frequently in manufacturing (19%), retail (18%), agriculture (18%), construction (16%), and non-professional services (15%). A net negative 2% of owners plan inventory investment in the coming months.\n\nThe net percent of owners raising average selling prices decreased three points from May to a net 69% (seasonally adjusted). Price raising activity over the past 12 months has escalated, reaching levels not seen since the early 1980s when prices were rising at double digit rates.\n\nUnadjusted, 4% of owners reported lower average selling prices and 69% reported higher average prices. Price hikes were the most frequent in retail trades (80% higher, 3% lower), transportation (78% higher, 0% lower), construction (75% higher, 4% lower), and wholesale (69% higher, 7% lower). Seasonally adjusted, a net 44% plan price hikes.\n\nA net 48% (seasonally adjusted) reported raising compensation, down one point from May. A net 28% of owners plan to raise compensation in the next three months, up three points from May and historically very high. Eight percent of owners cited labor costs as their top business problem and 23% said that labor quality was their top business problem.\n\nThe frequency of reports of positive profit trends was a net negative 25%, down one point from May. Among the owners reporting lower profits, 30% blamed the rise in the cost of materials, 16% blamed weaker sales, 14% cited labor costs, 14% cited lower prices, 7% cited the usual seasonal change, and 2% cited higher taxes or regulatory costs. For owners reporting higher profits, 51% credited sales volumes, 19% cited higher prices, and 17% cited usual seasonal change.\n\nOne percent of owners reported that all their borrowing needs were not satisfied. Twenty-seven percent reported all credit needs met and 61% said they were not interested in a loan. A net 3% reported their last loan was harder to get than in previous attempts. Only 1% reported that financing was their top business problem.", "images": ["http://www.nfib-sbet.org/wp-content/themes/nfib/img/homespinner.gif", "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif"], "top_img": "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "NFIB", "meta_data": {"viewport": "width=1024"}, "movies": [], "publish_date": null, "source": "http://www.nfib-sbet.org", "summary": ""}