{"url": "www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "text": "We were sitting in a small meadow where a contingent of the sort of young, arty types who seem to make up two-thirds of Wellington’s population were setting up for an outdoor production of Shakespeare’s “Twelfth Night.” Flynn was with us, chasing birds and, at one point, attempting to join a group of teenage boys at soccer practice. “Like this, what we’re doing right now, just sitting in a park, out in public, I can’t do this anywhere else,” Kerr continued. “In Los Angeles, there are people camped out in our driveway every day, waiting to follow us wherever we go.”\n\nKerr, who is gracious and easygoing with a hidden sarcastic streak (her personality is an extension of her slyly wholesome look), didn’t sound annoyed; it was simply a fact of her life, albeit one that’s nice to be able to put on hold once in a while. Earlier in the week, she and Bloom had spent two days wandering the city for the photos in these pages, heading to some of their favorite places in town: the Maranui Cafe, a lax, bohemian restaurant in a historic lifeguarding school; Red Rocks Scientific Reserve, a desolate stretch of beach peppered with iron-hued volcanic rocks; and the Hill Street Farmers’ Market, a Saturday morning institution. I joined them for much of the shoot and was surprised to see that no one paid them much attention — and not in that New York or Los Angeles way of pretending not to recognize a celebrity. “People here are just really real,” Bloom remarked during a break from the shoot, over lunch at the bistro Floriditas, a regular stop for the two. “They don’t care about the same things that everyone else does.”\n\nBut because Kerr and Bloom are required to appear in public so often, they spent most of their time in Wellington at home, away from the demands of the world. A typical morning: Bloom would cook breakfast and brew a pot of tea while Kerr fed Flynn. A typical evening: Kerr, the more ambitious chef of the two, would make dinner — grilled salmon and roasted chicken are favorites. After that she’d put her iPod on shuffle and turn up the volume, signaling the start of an impromptu family dance party — Kerr, Bloom and Flynn getting down to everything from Dr. Dre to Mozart. An exception to this rule was made at the Botanic Garden, when Bloom rang Kerr on her cellphone and, on a whim, she suggested that he meet her at the park so they could catch the Shakespeare performance. A great idea, Bloom agreed, though he did have one caveat that reminded me of how protective they were of their privacy in Wellington: he made sure that I not join them. “I’m sorry, but he’s kind of the gatekeeper,” Kerr said. “He has to be, as a husband and a father.” Fair enough: If I were in his shoes, I would have asked me to leave, too. As I left, I imagined the three of them at the show, in the middle of a crowd and yet totally invisible.\n\nLater in the week I met up with Kerr at a cafe called Scorch-O-Rama (that it overlooks Scorching Bay doesn’t quite make the name forgivable). A mellow little spot, it’s just a few hundred yards from their house and had become a mainstay for the couple. Over something called “gunpowder” green tea, I asked her to describe a moment that epitomized what she loves about Wellington. Her face puckered up in thought. I had had a few of my own adventures since first meeting her, including an unexpected late night with strangers (who quickly felt like friends) at a cocktail lounge called Havana Bar near Cuba Street, Wellington’s answer to Brooklyn’s Bedford Avenue. Such moments seem particularly easy to come by in the city, and I figured Kerr, her homebody proclivities aside, might have a few to share. But after a moment, she simply pointed to a small sliver of beach across the street. “That beach right there? I take Flynn there a lot, just to play in the sand,” she said. “And I was there with him a few days ago, right after coming back from a job in Tokyo. He was covered in sand, I was covered in sand, but it didn’t matter.” As they began to head back to the house, Bloom showed up on his mountain bike, which he often rode to the set of “The Hobbit.” “Orlando started showing Flynn some tricks on his bike, and Flynn kept shouting, ‘More! More!’ ” Kerr paused for a moment. She is a woman who gets genuinely misty when discussing the joys of family. “It sounds so simple, I know,” she said, “but that’s kind of what it’s all about here. Just those small moments that you can’t have anywhere else.”", "images": ["https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png?year=2012", "https://static01.nyt.com/images/2012/08/19/t-magazine/19well-kerr/19well-kerr-jumbo.jpg?quality=75&auto=webp&disable=upscale"], "top_img": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png?year=2012", "keywords": [], "authors": ["David Amsden"], "canonical_link": "https://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "title": "Miranda Kerr Goes Kiwi", "meta_data": {"robots": "noarchive, max-image-preview:large", "description": "To cap off an extended stay in New Zealand with her family, Miranda Kerr gives Wellington a whirl in fall’s white shirts and strappy flats. And this time her movie-star husband is behind the camera.", "og": {"url": "https://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "type": "article", "title": "Kerr Goes Kiwi (Published 2012)", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png?year=2012", "description": "To cap off an extended stay in New Zealand with her family, Miranda Kerr gives Wellington a whirl in fall’s white shirts and strappy flats. And this time her movie-star husband is behind the camera."}, "twitter": {"url": "https://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "title": "Kerr Goes Kiwi (Published 2012)", "description": "To cap off an extended stay in New Zealand with her family, Miranda Kerr gives Wellington a whirl in fall’s white shirts and strappy flats. And this time her movie-star husband is behind the camera.", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultCrop.png?year=2012", "card": "summary_large_image", "app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nyt://article/5196debf-df92-568a-88e5-0f6dc9f353c8"}}, "site": "@nytimes"}, "article": {"published_time": "2012-08-17T13:00:08.000Z", "modified_time": "2012-08-23T18:39:40.000Z", "section": "T Magazine", "tag": "New Zealand", "opinion": "false", "content_tier": "metered"}, "articleid": 100000001686367, "nyt_uri": "nyt://article/5196debf-df92-568a-88e5-0f6dc9f353c8", "pubp_event_id": "pubp://event/ab728b125063428ead3db8d8b007f155", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png?year=2012", "byl": "By David Amsden", "news_keywords": "Miranda Kerr,Models,New Zealand", "pdate": 20120817, "CG": "t-magazine", "PT": "article", "PST": "News", "url": "https://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "msapplication-starturl": "https://www.nytimes.com", "al": {"android": {"url": "nyt://article/5196debf-df92-568a-88e5-0f6dc9f353c8", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2012/08/17/t-magazine/miranda-kerr-goes-kiwi.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 9869919170}, "slack-app-id": "A0121HXPPTQ"}, "movies": [], "publish_date": 1345176000.0, "source": "http://www.nytimes.com", "summary": ""}